## Feature scaling

In [1]:
import pandas as pd

In [2]:
import os

In [3]:
os.chdir("C:\\Users\\KIRTI RAJ PRADHAN\\Downloads")

In [29]:
df=pd.read_excel("titanic_data.xlsx",usecols=['Age'])

In [30]:
df.head()

    Age
0  22.0
1  38.0
2  26.0
3  35.0
4  35.0

In [31]:
df.isnull().sum()

Age    177
dtype: int64

In [32]:
df['Age'].fillna(df['Age'].median(),inplace=True)

In [33]:
df["Age"]

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888    28.0
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64

## Standardistion
   z=(x-x_mean)/std

In [40]:
from sklearn.preprocessing import StandardScaler

In [41]:
sc=StandardScaler()

In [42]:
df['Age_sc']=sc.fit_transform(df[['Age']])

In [43]:
df

      Age    Age_sc
0    22.0 -0.565736
1    38.0  0.663861
2    26.0 -0.258337
3    35.0  0.433312
4    35.0  0.433312
..    ...       ...
886  27.0 -0.181487
887  19.0 -0.796286
888  28.0 -0.104637
889  26.0 -0.258337
890  32.0  0.202762

[891 rows x 2 columns]